app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Computer Science"], ["room_number", 5]]
---
  def create
    @school_class = SchoolClass.create(params[:school_class])

UPDATE "school_classes" SET "title" = ?, "room_number" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["id", 1]]
---
  def update
    @school_class.update(params[:school_class])