app/controllers/students_controller.rb

  def create
    @student = Student.create(params[:student])
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2017-06-11 16:58:35.646075"], ["updated_at", "2017-06-11 16:58:35.646075"]]

  def update
    @student.update(params[:student])
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2017-06-11 16:58:36.020413"], ["id", 1]]